#ifndef KRX_KOSPI_OPTIONS_HPP
#define KRX_KOSPI_OPTIONS_HPP

#include "jshash.hpp"

enum eKrxOptionsHeader{
    t_KrxOptionsBestQuotation = 1629858793,// JSHash(B6034,5) 
    t_KrxOptionsTrade = 1611359895,// JSHash(A3034,5) 
    t_KrxOptionsTradeBestQuotation = 1618535850,// JSHash(G7034,5) 
    t_KrxOptionsEnd = 1612413213,// JSHash(A6034,5) 
    t_KrxOptionsMarketManage = 1611938576,// JSHash(A7034,5) 
    t_KrxOptionsSpace = 1618603596,// JSHash(G9034,5) 
    t_KrxOptionsDistribute = 1696059202,// JSHash(O6034,5) 
    t_KrxOptionsInvestorData = 1701177067,// JSHash(H1034,5) 
    t_KrxOptionsUnsettled = 1701402316,// JSHash(H2034,5) 
    t_KrxOptionsMargin = 1702452665,// JSHash(H3034,5) 
    t_KrxOptionsMarketpriceRecovery = 1612008420,// JSHash(B2034,5) 
    t_KrxOptionsPolling = 1637815616,// JSHash(I2034,5) 
    t_KrxOptionsSettleBeforeOpen = 1623615942,// JSHash(M7034,5) 
    t_KrxOptionsOpenMarketManage = 1623649775,// JSHash(M4034,5) 
    t_KrxOptionsGreek = 1625671968,// JSHash(N7034,5) 
    t_KrxOptionsImpvol = 1023736724,// JSHash(,5) 
};

struct KrxOptionsBestQuotation;
struct KrxOptionsTrade;
struct KrxOptionsTradeBestQuotation;
struct KrxOptionsEnd;
struct KrxOptionsMarketManage;
struct KrxOptionsSpace;
struct KrxOptionsDistribute;
struct KrxOptionsInvestorData;
struct KrxOptionsUnsettled;
struct KrxOptionsMargin;
struct KrxOptionsMarketpriceRecovery;
struct KrxOptionsPolling;
struct KrxOptionsSettleBeforeOpen;
struct KrxOptionsOpenMarketManage;
struct KrxOptionsGreek;
struct KrxOptionsImpvol;

union KrxOptionsHeader{
    char * m_rawmsg;
    KrxOptionsBestQuotation * m_KrxOptionsBestQuotation;
    KrxOptionsTrade * m_KrxOptionsTrade;
    KrxOptionsTradeBestQuotation * m_KrxOptionsTradeBestQuotation;
    KrxOptionsEnd * m_KrxOptionsEnd;
    KrxOptionsMarketManage * m_KrxOptionsMarketManage;
    KrxOptionsSpace * m_KrxOptionsSpace;
    KrxOptionsDistribute * m_KrxOptionsDistribute;
    KrxOptionsInvestorData * m_KrxOptionsInvestorData;
    KrxOptionsUnsettled * m_KrxOptionsUnsettled;
    KrxOptionsMargin * m_KrxOptionsMargin;
    KrxOptionsMarketpriceRecovery * m_KrxOptionsMarketpriceRecovery;
    KrxOptionsPolling * m_KrxOptionsPolling;
    KrxOptionsSettleBeforeOpen * m_KrxOptionsSettleBeforeOpen;
    KrxOptionsOpenMarketManage * m_KrxOptionsOpenMarketManage;
    KrxOptionsGreek * m_KrxOptionsGreek;
    KrxOptionsImpvol * m_KrxOptionsImpvol;
};

inline eKrxOptionsHeader getTypeKrxOptionsHeader(const char *str){
    return (eKrxOptionsHeader) JSHash(str,5);
}


struct KrxOptionsBestQuotation{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char marketstatecode[2];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char bidtotalquantity[7];
	unsigned char bid1price[5];	// ??) 999.99
	unsigned char bid1quantity[7];
	unsigned char bid2price[5];	// ??) 999.99
	unsigned char bid2quantity[7];
	unsigned char bid3price[5];	// ??) 999.99
	unsigned char bid3quantity[7];
	unsigned char bid4price[5];	// ??) 999.99
	unsigned char bid4quantity[7];
	unsigned char bid5price[5];	// ??) 999.99
	unsigned char bid5quantity[7];
	unsigned char asktotalquantity[7];
	unsigned char ask1price[5];	// ??) 999.99
	unsigned char ask1quantity[7];
	unsigned char ask2price[5];	// ??) 999.99
	unsigned char ask2quantity[7];
	unsigned char ask3price[5];	// ??) 999.99
	unsigned char ask3quantity[7];
	unsigned char ask4price[5];	// ??) 999.99
	unsigned char ask4quantity[7];
	unsigned char ask5price[5];	// ??) 999.99
	unsigned char ask5quantity[7];
	unsigned char bidtotalvalidnum[5];
	unsigned char bid1totalvalidnum[4];
	unsigned char bid2totalvalidnum[4];
	unsigned char bid3totalvalidnum[4];
	unsigned char bid4totalvalidnum[4];
	unsigned char bid5totalvalidnum[4];
	unsigned char asktotalvalidnum[5];
	unsigned char ask1totalvalidnum[4];
	unsigned char ask2totalvalidnum[4];
	unsigned char ask3totalvalidnum[4];
	unsigned char ask4totalvalidnum[4];
	unsigned char ask5totalvalidnum[4];
	unsigned char timestamp[8];
	unsigned char expectedprice[5];	// ??) 999.99 ????????ø? ???? (?????±??????:10;20;30;80)
	unsigned char eot[1];	// %Hff
};

struct KrxOptionsTrade{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char currentprice[5];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char tradequantity[7];
	unsigned char tradetype[2];	// ??) 999.99
	unsigned char timestamp[8];
	unsigned char marketprice[5];	// ??) 999.99
	unsigned char highprice[5];
	unsigned char lowprice[5];	// ??) 999.99
	unsigned char lastprice[5];
	unsigned char accumtradequantity[8];	// ??) 999.99
	unsigned char accumtradeamount[11];
	unsigned char eot[1];	// ??) 999.99
};

struct KrxOptionsTradeBestQuotation{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char currentprice[5];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char tradequantity[7];
	unsigned char tradetype[2];	// ??) 999.99
	unsigned char timestamp[8];
	unsigned char marketprice[5];	// ??) 999.99
	unsigned char highprice[5];
	unsigned char lowprice[5];	// ??) 999.99
	unsigned char lastprice[5];
	unsigned char accumtradequantity[8];	// ??) 999.99
	unsigned char accumtradeamount[11];
	unsigned char marketstatecode[2];	// ??) 999.99
	unsigned char bidtotalquantity[7];
	unsigned char bid1price[5];
	unsigned char bid1quantity[7];	// ??) 999.99
	unsigned char bid2price[5];
	unsigned char bid2quantity[7];	// ??) 999.99
	unsigned char bid3price[5];
	unsigned char bid3quantity[7];	// ??) 999.99
	unsigned char bid4price[5];
	unsigned char bid4quantity[7];	// ??) 999.99
	unsigned char bid5price[5];
	unsigned char bid5quantity[7];	// ??) 999.99
	unsigned char asktotalquantity[7];
	unsigned char ask1price[5];
	unsigned char ask1quantity[7];
	unsigned char ask2price[5];
	unsigned char ask2quantity[7];
	unsigned char ask3price[5];
	unsigned char ask3quantity[7];
	unsigned char ask4price[5];
	unsigned char ask4quantity[7];
	unsigned char ask5price[5];
	unsigned char ask5quantity[7];
	unsigned char bidtotalvalidnum[5];
	unsigned char bid1totalvalidnum[4];
	unsigned char bid2totalvalidnum[4];
	unsigned char bid3totalvalidnum[4];	// ??) 999.99 ????????ø? ???? (?????±??????:10;20;30;80)
	unsigned char bid4totalvalidnum[4];	// %Hff
	unsigned char bid5totalvalidnum[4];	// A3
	unsigned char asktotalvalidnum[5];	// 03:KOSPI200????????
	unsigned char ask1totalvalidnum[4];	// 4
	unsigned char ask2totalvalidnum[4];
	unsigned char ask3totalvalidnum[4];
	unsigned char ask4totalvalidnum[4];	// ??) 999.99
	unsigned char ask5totalvalidnum[4];
	unsigned char eot[1];	// 1)?????  10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ?????????  40 : ???? 80 : ???????u??
};

struct KrxOptionsEnd{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char endprice[5];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char endpricecode[1];
	unsigned char accumtradequantity[8];	// ??) 999.99
	unsigned char accumtradeamount[11];
	unsigned char bidtotalquantity[7];	// ??) 999.99
	unsigned char bid1price[5];
	unsigned char bid1quantity[7];	// ??) 999.99
	unsigned char bid2price[5];
	unsigned char bid2quantity[7];	// ??) 999.99
	unsigned char bid3price[5];
	unsigned char bid3quantity[7];	// ??) 999.99
	unsigned char bid4price[5];
	unsigned char bid4quantity[7];
	unsigned char bid5price[5];	// ??) 999.99
	unsigned char bid5quantity[7];
	unsigned char asktotalquantity[7];	// ??) 999.99
	unsigned char ask1price[5];
	unsigned char ask1quantity[7];	// ??) 999.99
	unsigned char ask2price[5];
	unsigned char ask2quantity[7];	// ??) 999.99
	unsigned char ask3price[5];
	unsigned char ask3quantity[7];	// ??) 999.99
	unsigned char ask4price[5];
	unsigned char ask4quantity[7];
	unsigned char ask5price[5];
	unsigned char ask5quantity[7];
	unsigned char bidtotalvalidnum[5];
	unsigned char bid1totalvalidnum[4];
	unsigned char bid2totalvalidnum[4];
	unsigned char bid3totalvalidnum[4];
	unsigned char bid4totalvalidnum[4];
	unsigned char bid5totalvalidnum[4];
	unsigned char asktotalvalidnum[5];
	unsigned char ask1totalvalidnum[4];
	unsigned char ask2totalvalidnum[4];
	unsigned char ask3totalvalidnum[4];
	unsigned char ask4totalvalidnum[4];	// ??) 999.99 ????????ø? ???? (?????±??????:10;20;30;80)
	unsigned char ask5totalvalidnum[4];	// %Hff
	unsigned char eot[1];	// A3
};

struct KrxOptionsMarketManage{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	unsigned char timestamp[8];
	unsigned char marketmanagecode[3];
	unsigned char stockid[10];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	char krcode[12];
	unsigned char seq[3];	// ??) 999.99
	unsigned char marketstatecode[2];
	unsigned char bidaskexistyn[1];	// ??) 999.99
	unsigned char bidtotalquantity[7];
	unsigned char bid1price[5];	// ??) 999.99
	unsigned char bid1quantity[7];
	unsigned char bid2price[5];	// ??) 999.99
	unsigned char bid2quantity[7];
	unsigned char bid3price[5];	// ??) 999.99
	unsigned char bid3quantity[7];
	unsigned char bid4price[5];
	unsigned char bid4quantity[7];	// ??) 999.99
	unsigned char bid5price[5];
	unsigned char bid5quantity[7];	// ??) 999.99
	unsigned char asktotalquantity[7];
	unsigned char ask1price[5];	// ??) 999.99
	unsigned char ask1quantity[7];
	unsigned char ask2price[5];	// ??) 999.99
	unsigned char ask2quantity[7];
	unsigned char ask3price[5];	// ??) 999.99
	unsigned char ask3quantity[7];
	unsigned char ask4price[5];
	unsigned char ask4quantity[7];
	unsigned char ask5price[5];
	unsigned char ask5quantity[7];
	unsigned char bidtotalvalidnum[5];
	unsigned char bid1totalvalidnum[4];
	unsigned char bid2totalvalidnum[4];
	unsigned char bid3totalvalidnum[4];
	unsigned char bid4totalvalidnum[4];
	unsigned char bid5totalvalidnum[4];
	unsigned char asktotalvalidnum[5];
	unsigned char ask1totalvalidnum[4];
	unsigned char ask2totalvalidnum[4];
	unsigned char ask3totalvalidnum[4];	// ??) 999.99 ????????ø? ???? (?????±??????:10;20;30;80)
	unsigned char ask4totalvalidnum[4];	// %Hff
	unsigned char ask5totalvalidnum[4];	// A3
	unsigned char eot[1];	// 03:KOSPI200????????
};

struct KrxOptionsSpace{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	unsigned char eot[1];
};

struct KrxOptionsDistribute{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char distribute_startorend[1];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char distributetype[1];
	unsigned char distributeendtime[8];	// ??) 999.99
	unsigned char eot[1];
};

struct KrxOptionsInvestorData{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	unsigned char createdate[8];
	unsigned char createtime[6];
	unsigned char investordatatype[2];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char stockid[10];
	unsigned char optiontype[1];	// ??) 999.99
	unsigned char investortype[4];
	unsigned char bidsettledquantity[9];	// ??) 999.99
	unsigned char asksettledquantity[9];
	unsigned char bidsettledamount[18];	// ??) 999.99
	unsigned char asksettledamount[18];
	unsigned char eot[1];	// ??) 999.99
};

struct KrxOptionsUnsettled{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char unsettledtype[2];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char tradedate[8];
	unsigned char unsettledamount[9];	// ??) 999.99
	unsigned char eot[1];
};

struct KrxOptionsMargin{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char marginprice[16];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	char margintype[1];
	unsigned char exerciseprice[16];	// ??) 999.99
	char exercisetype[1];
	unsigned char eot[1];	// ??) 999.99
};

struct KrxOptionsMarketpriceRecovery{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char currentprice[5];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char marketprice[5];
	unsigned char highprice[5];	// ??) 999.99
	unsigned char lowprice[5];
	unsigned char unsettledamount[9];	// ??) 999.99
	unsigned char accumtradequantity[8];
	unsigned char accumtradeamount[11];	// ??) 999.99
	unsigned char ask1price[5];
	unsigned char ask1quantity[7];	// ??) 999.99
	unsigned char ask1num[4];
	unsigned char bid1price[5];	// ??) 999.99
	unsigned char bid1quantity[7];
	unsigned char bid1num[4];
	unsigned char ask2price[5];	// ??) 999.99
	unsigned char ask2quantity[7];
	unsigned char ask2num[4];	// ??) 999.99
	unsigned char bid2price[5];
	unsigned char bid2quantity[7];	// ??) 999.99
	unsigned char bid2num[4];
	unsigned char ask3price[5];	// ??) 999.99
	unsigned char ask3quantity[7];
	unsigned char ask3num[4];	// ??) 999.99
	unsigned char bid3price[5];
	unsigned char bid3quantity[7];
	unsigned char bid3num[4];
	unsigned char ask4price[5];
	unsigned char ask4quantity[7];
	unsigned char ask4num[4];
	unsigned char bid4price[5];
	unsigned char bid4quantity[7];
	unsigned char bid4num[4];
	unsigned char ask5price[5];
	unsigned char ask5quantity[7];
	unsigned char ask5num[4];
	unsigned char bid5price[5];
	unsigned char bid5quantity[7];
	unsigned char bid5num[4];	// ??) 999.99 ????????ø? ???? (?????±??????:10;20;30;80)
	unsigned char asktotalquantity[7];	// %Hff
	unsigned char asktotalnum[5];	// A3
	unsigned char bidtotalquantity[7];	// 03:KOSPI200????????
	unsigned char bidtotalnum[5];	// 4
	unsigned char marketstatetype[2];
	unsigned char marketmanagetype[3];
	unsigned char expectedprice[5];	// ??) 999.99
	unsigned char eot[1];
};

struct KrxOptionsPolling{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	unsigned char timestampHHSS[4];
	unsigned char mainorbackup[2];
	unsigned char filler[8];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char eot[1];
};

struct KrxOptionsSettleBeforeOpen{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	char krcode[12];
	unsigned char seq[3];
	unsigned char settledprice[5];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char settledquantity[7];
	unsigned char settledcode[2];	// ??) 999.99
	unsigned char filler[15];
	unsigned char eot[1];	// ??) 999.99
};

struct KrxOptionsOpenMarketManage{
	unsigned char datatype[2];	// B6
	unsigned char infotype[2];	// 1
	unsigned char markettype[1];	// 4
	unsigned char timestamp[8];
	unsigned char marketmanagecode[3];
	unsigned char stockid[10];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	char krcode[12];
	unsigned char seq[3];	// ??) 999.99
	unsigned char marketstatecode[2];
	unsigned char eot[1];	// ??) 999.99
};

struct KrxOptionsGreek{
	char datatype[2];	// B6
	char infotype[2];	// 1
	char markettype[1];	// 4
	char krcode[12];
	char seq[7];
	char createddate[8];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	char createdtime[8];
	char createdwhencode[1];	// ??) 999.99
	char deltasign[3];
	char delta[1];	// ??) 999.99
	unsigned char thetasign[18];
	char theta[1];	// ??) 999.99
	unsigned char vegasign[18];
	char vega[1];	// ??) 999.99
	unsigned char gammasign[18];
	char gamma[1];	// ??) 999.99
	unsigned char rhosign[18];
	char rho[1];
	unsigned char eot[18];	// ??) 999.99
};

struct KrxOptionsImpvol{
	char datatype[2];	// B6
	char infotype[2];	// 1
	char markettype[1];	// 4
	unsigned char callaverageiv[10];
	unsigned char putaverageiv[10];
	unsigned char representativeiv[10];	// *????? o???? ?????? 00 : ???(??????) 10 : ?ð?????? 11 : ?ð?????????? 20 : ???????? 21 : ???????????? 30 : ????????? 40 : ???? 80 : ???????u??(?????u??) 90 : ??????? 99 : ??????
	unsigned char historicaliv90day[10];
	char eot[1];	// ??) 999.99
};
#endif
